{"snippets":{"2019-03-31_1":"TextGlue has two workflows: snippets and chapters.\nSnippets is simply a collection of texts. Each snippet is simply a text (with an ID), which can be equipped with additional metadata like name, summary or tags.\nThese metadata will normally not enter into finished document, they just help to organize the snippets.\n\nSnippets can be arranged in one or more documents. (The default document is called \"document\".)\nDocument contains chapters and chapters are sequences of snippets.\n\n\n","textglue":"TextGlue is a simplistic text editor for writers.\nOr maybe just for a single writer - for me...\n\nOnce upon the time I decided to write a book. I have never done that before. Writing is hard and the worst is to know what to write.\nSometimes you just stare at the keyboard for hours writing the same sentence, deleting it and writing again...\nI have to admit, I was terrified of writing. But these tricks helped:\n- I wrote whatever come to my mind (keeping the \"whatever\" in line with the topic).\n- I used plane text - no formatting, no nonsense that would distract me from writing.\nIt worked for a while. I think by now I have about hundred pages of text. But it is terribly unstructured - it is just a collection of text snippets. They somehow cover the topics I wanted to cover,\nbut they have two big problems: a) they overlap and b) they are not ordered in any way.\n\nAt the same time I got another problem: I wanted to learn a couple of things - namely rust, vue and webassembly. Hence the TextGlue was born!\nI could learn what I wanted to learn on a reasonably small project - and I will solve my little writing problem as well. That's called synergy!\n\nWell, to be honest TextGlue became the ultimate distraction. SInce I started working on it, I did not write anything - so it is not entirely a success, but hey! I've learned something!\n\n","2019-03-31":"TextGlue is based on these design principles:\n- Simplicity above all.\n- Use simple text only. (Perhaps markdown in the future.)\n- Simple text files for storing. Allow to remove, add and edit in any text editors.\n- Metadata in yaml files - as well easily editable/hackable.\n- Low friction. Start new text by a single click. No name, folder or chapter selection necessary. All these can be done later.\n- Organize later.\n- Keep text in snippets as long as possible - even when chapters are already formed."},"metadata":{"textglue":{"name":"TextGlue Story","summary":"Little story about how TextGlue started","tags":["story","intro"]},"2019-03-31":{"name":"Design","summary":"Design principles behind TextGlue","tags":["design"]},"2019-03-31_1":{"name":"Structure","summary":"Explanation of how TextGlue is organized","tags":["structure"]}},"documents":{"document":{"name":"Document","chapters":[{"name":"Introduction","snippets":["textglue","2019-03-31"]},{"name":"Structure","snippets":["2019-03-31_1"]}]}}}